use TAXI2019;
go

Create Table STREET (
Id int identity(1,1) not null primary key,
Street nvarchar(MAX) not null
);

Create Table ADDRESS (
Id int identity (1,1) not null primary key,
House nvarchar(MAX) not null,
StreetId int not null,
Foreign key (StreetId) references STREET(Id)
);

Create Table CAR_MODEL (
Id int identity(1,1) not null primary key,
Model nvarchar(MAX) not null
);

Insert into CAR_MODEL(Model)
values ('x6');

Create Table TARIFS (
Id int identity(1,1) not null primary key,
Type nvarchar(MAX) not null
);

Insert into TARIFS(Type)
values ('ÊÎÌÔÎĞÒ');

Select * from TARIFS;
Select * from CAR_MODEL;

Create Table CAR (
Id int identity(1,1) not null primary key,
TypeModel nvarchar(MAX) not null,
TarifId int not null,
CarModelId int not null,
Foreign key (TarifId) references TARIFS(Id),
Foreign key (CarModelId) references CAR_MODEL(Id),
);

Insert into CAR(TypeModel, TarifId, CarModelId)
values ('BMW', 1, 1);

Create Table CLIENT (
Id int identity(1,1) not null primary key,
Surname nvarchar(20) not null,
Firstname nvarchar(20) not null,
Card nvarchar(16) not null,
Phone nvarchar(13) not null,
Balance float not null
);


Create Table DRIVER_STATUS (
Id int identity(1,1) not null primary key,
Status nvarchar(20) not null
);

Insert into DRIVER_STATUS(Status)
values ('FREE');

Create Table TRIP_STATUS (
Id int identity(1,1) not null primary key,
Status nvarchar(20) not null
);


Create Table DRIVER (
Id int identity(1,1) not null primary key,
Surname nvarchar(20) not null,
Firstname nvarchar(20) not null,
Fathersname nvarchar(20) not null,
Card nvarchar(16) not null,
Phone nvarchar(13) not null,
Balance float not null,
CarId int not null,
StatusId int not null,
Foreign key (CarId) references CAR(Id),
Foreign key (StatusId) references DRIVER_STATUS(Id)
);

Create Table TRIP (
Id int identity(1,1) not null primary key,
StartDate nvarchar(MAX) not null,
FinishDate nvarchar(MAX) not null,
Tarif nvarchar(MAX) not null,
Summa float not null,
Distance float not null,
ToAddressId int not null,
Rating float not null,
FromAddressId int not null,
ClientId int not null,
DriverId int not null,
StatusId int not null,
Foreign key (ToAddressId) references ADDRESS(Id),
Foreign key (FromAddressId) references ADDRESS(Id),
Foreign key (ClientId) references CLIENT(Id),
Foreign key (DriverId) references DRIVER(Id),
Foreign key (StatusId) references TRIP_STATUS(Id)
);


Create Table "USER" (
Id int identity(1,1) not null primary key,
Login nvarchar(20) not null,
Password nvarchar(20) not null,
Role nvarchar(MAX),
ClientId int,
DriverId int,
Foreign key (ClientId) references CLIENT(Id),
Foreign key (DriverId) references DRIVER(Id)
);



Create Procedure AddDriver
	@pSurname nvarchar(50),
	@pFirstname nvarchar(50), 
	@pFathername nvarchar(50),
	@pCard nvarchar(50),
	@pPhone nvarchar(50),
	@pBalance float,
	@pCarId int,
	@pStatusId int,
    @responseMessage nvarchar(250) output
as
Begin
    SET NOCOUNT ON

    Begin try

        Insert into DRIVER(Surname, Firstname, Fathersname, Card, Phone, Balance, CarId, StatusId)
        values(@pSurname, @pFirstname, @pFathername, @pCard, @pPhone, @pBalance, @pCarId, @pStatusId)

        SET @responseMessage='Success'

    End try
    Begin catch
        SET @responseMessage=ERROR_MESSAGE() 
    End catch
End

Declare
	@responseMessage nvarchar(250)
EXEC AddDriver
          @pSurname = N'Borya',
          @pFirstname = N'Zhevachka',
		  @pFathername = N'Fineamonovich',
          @pCard = N'2222111133334444',
          @pPhone = N'+375445842381',
		  @pBalance = 2.4,
		  @pCarId = 1,
		  @pStatusId = 1,
          @responseMessage=@responseMessage OUTPUT
Select * From DRIVER;
Go

Create procedure CountOfUsers
as
begin
Select count(*) from USERs
end;

declare @id int
select @id = 1
while @id >=1 and @id <=100000													
begin	
	insert into Clients (Surname, Firstname, Card, Phone, Balance) values
						(concat('Surname', convert(nvarchar, @id)), concat('Firstname', convert(nvarchar, @id)) , concat('4255200052', CONVERT(nvarchar, 100000+@id)), concat('+375299', CONVERT(nvarchar, 100000+@id)), 100+@id)
	select @id = @id + 1
end

select count(*) from Clients;

insert into USERs (Login, Password, Role, ClientID)
values			 ('Anastason', '1156371652', 'Admin', 3);

insert into CAR_MODEL(Model)
values			 ('BMW'), ('TESLA'), ('MERCEDES BENZ');

insert into TARIFs (Type)
values ('ÊÎÌÔÎĞÒ'), ('ÑÒÀÍÄÀĞÒ'), ('İËÈÒ');

insert into DRIVER_STATUS (Status)
values ('ÇÀÍßÒ');

insert into TRIP_STATUS (Status)
values ('Â ÏĞÎÖÅÑÑÅ'), ('ÇÀÂÅĞØÅÍÀ');


insert into STREETs(Street)
values  ('50 ëåò Ïîáåäû'), ('3 Ñåíòÿáğÿ'), ('Àáğèêîñîâàÿ'), ('Àâàêÿíà'), ('Àâàíãàğäíàÿ'), ('Àâèàöèè'),
		('Àâğîğîâñêàÿ'), ('Àâòîäîğîâñêàÿ'), ('Àâòîçàâîäñêàÿ'), ('Àâòîìîáèëèñòîâ'), ('Àçãóğà'), ('Àçèçîâà'),
		('Àçîâñêàÿ'), ('Àéâàçîâñêîãî'), ('Àêàäåìè÷åñêàÿ'), ('Àëàäîâûõ'), ('Àëåêñàíäğîâñêàÿ'), ('Àëèáåãîâà'),
		('Àëëåéíàÿ'), ('Àëòàéñêàÿ'), ('Àığîôëîòñêàÿ'), ('Àığîäğîìíàÿ'), ('Àóıçîâà'), ('Àñàíàëèåâà'),
		('Àğòèëëåğèñòîâ'), ('Àğò¸ìà'), ('Àğêòè÷åñêàÿ 1-ÿ'), ('Àğêòè÷åñêàÿ 2-ÿ'), ('Àğàíñêàÿ'), ('Àïîëèíàğüåâñêàÿ'),
		('Àíòîíîâñêàÿ'), ('Êîëëåêòèâíàÿ'), ('Àíäğååâñêàÿ'), ('Àíãàğñêàÿ'), ('Àìóğñêàÿ'), ('Àìóğàòîğñêàÿ'),
		('Àìáóëàòîğíàÿ'),
		
		('Áàáóøêèíà'), ('Áàãğàòèîíà'), ('Áàãğÿíàÿ'), ('Áàçèñíàÿ 1-ÿ'), ('Áàçèñíàÿ 2-ÿ'),
		('Áàéêàëüñêàÿ'), ('Áàêèíñêàÿ'), ('Áàëòèéñêàÿ'), ('Áàğàìçèíîé'), ('Áàğàíîâùèíà'), ('Áàñèàëîâñêàÿ'),
		('Áàòîğèíñêàÿ'), ('Áåãîìëüñêàÿ'), ('Áåäû Ëåîíèäà'), ('Áåëåöêîãî'), ('Áåëèíñêîãî'), ('Áåëüñêîãî'),
		('Áåëîìîğñêàÿ'), ('Áåëîğóññêàÿ'), ('Áåëü÷èöêàÿ'), ('Áåëÿåâà'), ('Áåğåçèíñêàÿ'), ('Áåğåçîãîğñêàÿ'),
		('Áåğåñòÿíñêàÿ'), ('Áåğñîíà'), ('Òğóáíàÿ'), ('Áåğóòà'), ('Áåõòåğåâà'), ('Áèáëèîòå÷íàÿ'),
		('Ãàëàíòåğåéíàÿ'), ('Áûõîâñêàÿ'), ('Áóğäåéíîãî'), ('Çàñëîíîâà'), ('Áóéíèöêîãî'), ('Áóéëî'),
		('Áóäñëàâñêàÿ'), ('Áóä¸ííîãî'), ('Áğåñò-Ëèòîâñêàÿ'), ('Áğîâêè'), ('Áğîâèêîâà'), ('Áğèëåâñêàÿ'),
		('Áğèêåòà'), ('Áğåñòñêàÿ'), ('Áğàòñêàÿ'), ('Áğàãèíñêàÿ'), ('Áîğîâàÿ'),
		('Áîëîòíàÿ'), ('Áîòàíè÷åñêàÿ'), ('Áîğîäèíñêàÿ'), ('Áîëîòíèêîâà'), ('Ìàêñèìà Áîãäàíîâè÷à'), ('Áîãäàíà Õìåëüíèöêîãî'),
		('Áèğşçîâà'), 
		
		('Âàâèëîâà'), ('Âàíååâà'), ('Âàíååâà'), ('Âàóïøàñîâà'), ('Âàñèëüêîâàÿ'),
		('Âåëîçàâîäñêàÿ'), ('Âàòóòèíà'), ('Âåëèêîìîğñêàÿ'), ('Âåğåñêîâàÿ'), ('Âåğåùàãèíà'), ('Âåğõíÿÿ'),
		('Çàâîäñêàÿ'), ('Âåñåííÿÿ'), ('Âçë¸òíàÿ'), ('Âèëêîâùèíà'), ('Âèëüÿìñà'), ('Âèíîãğàäíàÿ'),
		('Âèğñêàÿ'), ('Âèòåáñêàÿ'), ('Âÿçûíñêàÿ'), ('Âûøåëåññêîãî'), ('Âûñîêàÿ'), ('Âûãîòñêîãî'),
		('Âñòğå÷íàÿ'), ('Âîğîïàåâñêàÿ'), ('Âîğîíÿíñêîãî'), ('Âîëîõà'), ('Âîëîäüêî'), ('Âîëî÷àåâñêàÿ'),
		('Âîëîæèíñêàÿ'), ('Âîëîäàğñêîãî'), ('Âîëìÿíñêàÿ'), ('Âîëæñêàÿ'), ('Âîëãîäîíñêàÿ'),
		('Âîëãîãğàäñêàÿ'), ('Âîêçàëüíàÿ'), ('Âîäîëàæñêîãî'), ('Âîäîçàáîğíàÿ'), 
		
		('Ãàãàğèíà'), ('Ãàëî'),	('Ãàìàğíèêà'), ('Ãàøêåâè÷à'), ('Ãàñòåëëî'), ('Ãàÿ'), ('Ãâàğäåéñêàÿ'), 
		('Ãåäğîéöà'), ('Ãåîëîãè÷åñêàÿ'), ('Ãåğàñèìåíêî'), ('Ãåğöåíà'), ('Ãåğìàíîâñêàÿ 2-ÿ'), 
		('Ãåğîåâ 120-é Äèâèçèè'), ('Ãèêàëî'), ('Ãèíòîâòà'), ('Ãëàãîëåâà'), ('Ãëåáêè Ïåòğà'), ('Ãëóáîêñêàÿ'),
		('Ãîãîëåâñêàÿ'), ('Ãîëîäåäà'), ('Ãîëóáåâà'), ('Ãîëóáêà Âëàäèñëàâà'), ('Ãîëüøàíñêàÿ'), 
		('Ãîğîâöà'), ('Ãîğîäåöêàÿ'), ('Ãîğíàÿ'), ('Ãîğáàòîâà'), ('Ãîğåöêîãî'), ('Ãîğîäñêîé Âàë'), 
		('Ãğåáåëüêè'), ('Ãğåêîâà'), ('Ãğèáîåäîâà'),	('Ãğèöåâöà'), ('Ãğîäíåíñêàÿ'), ('Ãğîìîâà'), 
		('Ãğóøåâñêàÿ'), ('Ãóğñêîãî'), ('Ãóñîâñêîãî'), ('Ãóğòüåâà'), 
		
		('Äàóìàíà'), ('Äà÷íàÿ'), ('Äâèíñêàÿ'), ('Äâîğèùè'),	('Äåæí¸âà'), 
		('Äåêàáğèñòîâ'), ('Äåíèñîâñêàÿ'),	('Äåòäîìîâñêàÿ'), ('Äèìèòğîâà'), ('Äèñåíñêàÿ'), 
		('Äíåïğîâñêàÿ'), ('Äîâàòîğà'), ('Äîêó÷àåâà'), ('Äîêøèöêàÿ'), ('Äóíèíà-Ìàğöèíêåâè÷à'), 
		('Äóáğàâèíñêàÿ'), ('Äğóéñêàÿ'), ('Äğóæáû'), ('Äğóæíàÿ'), ('Äğîçäîâè÷à'), ('Äğîçäà'), 
		('Äğàæíÿ'), ('Äîëãîáğîäñêàÿ'), ('Äîñòîåâñêîãî'), ('Äîğîøåâè÷à'), ('Äîìåéêî'), ('Äîìáğîâñêàÿ'), 
		('Äîìàøåâñêàÿ'), 

		('Åâôğîñèíüè Ïîëîöêîé'), ('Åëüíèöêàÿ'), ('Åíèñåéñêàÿ'), ('Åğìàêà'), ('Åñåíèíà'), 
		
		('Æàñìèíîâàÿ'), ('Æåáğàêà'), ('Æèëóíîâè÷à'), ('Æåëåçíîäîğîæíàÿ'),('Æëîáèíñêàÿ'), ('Æóêîâñêîãî'), ('Æóäğî'), 

		('Çàáîğñêîãî'), ('Çàâîäñêàÿ'), ('Çàëèâíàÿ'), ('Çàìêîâàÿ'), 
		('Çàïàäíàÿ'), ('Çàïîğîæñêàÿ'), ('Çàïğóäíàÿ'), ('Çàğå÷àíñêàÿ'), ('Çàğå÷íàÿ'),
		('Çàñëàâñêàÿ'), ('Çàñëîíîâà'), ('Çàòèøüå'), ('Çàõàğîâà'), ('Çàöåíü'), ('Çûáèöêàÿ'),
		('Çóáà÷¸âà'), ('Çîëîòàÿ Ãîğêà'), ('Çèìíÿÿ'), ('Çåìëåäåëü÷åñêàÿ'), ('Çåìëåìåğíàÿ 1-ÿ'), 
		('Çåìëåìåğíàÿ 2-ÿ'), ('Çåëåíîëóãñêàÿ'), ('Çåë¸íàÿ'), ('Çâ¸çäíàÿ'), 
		
		('Èâàíîâñêàÿ'), ('Èâåíåöêàÿ'), ('Èãíàòåíêî'), ('Èçâîçíàÿ'), ('Èçìàéëîâñêàÿ'), 
		('Èëèìñêàÿ'), ('Èëüìåíñêàÿ'), ('Èíäóñòğèàëüíàÿ'), ('Èíæåíåğíàÿ'),
		('Èíòåğíàöèîíàëüíàÿ'), ('Èîäêîâñêàÿ'), ('Èğèíîâñêàÿ'), ('Èğêóòñêàÿ'), ('Èñêàëèåâà'),

		('Êàáóøêèíà'), ('Êàãàíöà'), ('Êàçåÿ'), ('Êàçèìèğîâñêàÿ'),
		('Êàëèíèíà'), ('Êàëèíîâñêîãî'), ('Êàëüâàğèéñêàÿ'), ('Êàçèíöà'), ('Êàìåííîãîğñêàÿ'),
		('Êàğàñòîÿíîâîé'), ('Êàğáûøåâà'), ('Êàğîëèíñêàÿ'), ('Êàğïîâà'), ('Êàõîâñêàÿ'), ('Êåäûøêî'),
		('Êèğèëëà è Ìåôîäèÿ'), ('Êèåâñêàÿ'), ('Êèæåâàòîâà'), ('Êèğååâà'), ('Êèğîâà'), ('Êèñåëåâà'),
		('Êëåöêàÿ'), ('Êëóìîâà'), ('Êëş÷åâàÿ'), ('Êíîğèíà'), ('Êîâàëåâà'), ('Êîâàëåâñêîé'),
		('Êîëåñíèêîâà'), ('Êîëõîçíàÿ'), ('Êîëëåêòîğíàÿ'), ('Êîììóíèñòè÷åñêàÿ'), ('Êîìñîìîëüñêàÿ'), 
		('Êîáğèíñêàÿ'),	('Êîçëîâà'), ('Êîçûğåâñêàÿ'), ('Êîëüöåâàÿ 1-ÿ'), ('Êîëüöåâàÿ 2-ÿ'), ('Êîëåñíèêîâà'),
		('Êîëüöåâàÿ'), ('Êîïûëüñêàÿ'), ('Êóğãàííàÿ '), ('Êóğ÷àòîâà'),
		('Êóòóçîâà'), ('Êóïğåâè÷à'),	('Êóïàëû'), ('Êóíöåâùèíà'), ('Êîëàñà'), ('Êóëüìàí'), 
		('Êóëèáèíà'), ('Êóëåøîâà'), ('Êóéáûøåâà'), ('Êóçíå÷íàÿ'), ('Êğèâàÿ'), ('Êóáàíñêàÿ'), 
		('Êğûëîâè÷à'), ('Êğóïöû'), ('Êğóïñêîé'), ('Êğèâè÷ñêàÿ'), ('Êğàìñêîãî'), ('Êğàéíÿÿ'),
		('Êğàñíîàğìåéñêàÿ '), ('Êğàñíîçâ¸çäíàÿ'), ('Êğàñíîñëîáîäñêàÿ'), ('Êğàñíàÿ Ñëîáîäà'), 
		('Êğàñíàÿ'), ('Êğàñèíà'), ('Êğàñèâàÿ'), ('Êğîïîòêèíà'), ('Êğàñíîäîíñêàÿ'), ('Êğàïèâû'), 
		('Êîçûğåâñêàÿ'), ('Êîëüöîâà'), ('Êîøåâîãî'), ('Êîòîâñêîãî'),	('Êîñìîíàâòîâ'), ('Êîñìîäåìüÿíñêîé'), 
		('Êîìàğîâñêîå Êîëüöî'), ('Êîğîëåíêî'), ('Êîğîòêåâè÷à'), ('Êîğîëÿ'), ('Êîğèöêîãî'),		
		('Êîğçşêè'), ('Êîğæåíåâñêîãî'), ('Êîğø-Ñàáëèíà'), ('Êîğæà'), ('Êîğâàòà'), ('Êëàğû Öåòêèí'),
		
		('Ëàçàğåâà'), ('Ëàçî'), ('Ëàíäåğà'), ('Ëåâêîâà'),('Ëåíèíà'), 
		('Ëåíèíãğàäñêàÿ'), ('Ëåïåëüñêàÿ'), ('Ëåğìîíòîâà'), ('Ëåñíàÿ'), ('Ëåòíÿÿ'),
		('Ëåùèíñêîãî'), ('Ëèáàâî-Ğîìåíñêàÿ'), ('Ëèáêíåõòà'), ('Ëèäñêàÿ'), ('Ëèïîâàÿ'), 
		('Ëèòåğàòóğíàÿ'), ('Ëşáàíñêàÿ'), ('Ëşêñåìáóğã'), ('Ëó÷èíû'), 
		('Ëóêüÿíîâè÷à'), ('Ìèõàñÿ Ëûíüêîâà'), ('Ëîøèöêàÿ'), ('Ëóãîâàÿ'), 
		('Ëîáàíêà'), ('Ëîæèíñêàÿ'), ('Ëîøèöà 2-ÿ'), ('Ëîìîíîñîâà'), ('Ëîäî÷íàÿ'),

		('Ìàãóëÿíñêàÿ'), ('Ìàãèñòğàëüíàÿ'), ('Ìàâğà'), ('Ìàãíèòíàÿ'), ('Ìàãàçèííàÿ'), ('Ìàçóğîâà'),
		('Ìàëàÿ'), ('Ìàëèíèíà'), ('Ìàëîôååâñêàÿ'), ('Ìàëÿâêè'), ('Ìàíåâè÷à'), 
		('Ìàğàòà'), ('Êàğëà Ìàğêñà'), ('Ìàğóñèíñêàÿ'), ('Ìàğüåâñêàÿ'), 
		('Ìàñşêîâùèíà'), ('Ìàòâååâñêàÿ'),	('Ìàòğîñîâà'), ('Ìàòóñåâè÷à'), ('Ìà÷óëüñêîãî'), 
		('Ìàøèíèñòîâ'), ('Ìàÿêîâñêîãî'), ('Ìàêà¸íêà'), ('Ìàøèíîñòğîèòåëåé'), ('Ìàêàğåíêî'), 
		('Ìåäâåæèíî'), ('Ìåëåæà'),  ('Ìåëèîğàòèâíàÿ'), ('Ìåëüíèêàéòå'), ('Ìåíäåëååâà'), 
		('Ìÿäåëüñêàÿ'), ('Ìÿñíèêîâà'), ('Ìîñêîâñêàÿ'),	('Ìîñêâèíà'), ('ÌÎÏĞà'), ('Ìîíşøêî'), 
		('Ìîíòàæíèêîâ'), ('Ìîçûğñêàÿ'), ('Ìîæàéñêîãî'), ('Ìîãèë¸âñêàÿ'), ('Ìèõàëîâî'), ('Ìèõàéëîâà'), 
		('Ìè÷óğèíà'), ('Ìèğîøíè÷åíêî'), ('Ìèğíàÿ'),	('Ìèíèíà'), ('Ìèêóëè÷à'), ('Ìèêîëàåâñêàÿ'), 
		('Ìåğæèíñêîãî'), 
		
		('Íàãîğíàÿ'), ('Íàäåæäèíñêàÿ'), ('Íàêëîííàÿ'), 
		('Íàëèáîêñêàÿ'), ('Íàğîäíàÿ'), ('Íàğî÷àíñêàÿ'), ('Íàòóğàëèñòîâ'), ('Íàõèìîâà'), ('Íåæäàíîâîé'),
		('Íåêğàñîâà'), ('Íîãèíà'), ('Íîâîóôèìñêàÿ'), ('Íîâîñåëüñêàÿ'), ('Íàáåğåæíàÿ'), 
		('Íåìèãà'), ('Íåñâèæñêàÿ'), ('Íîâîâèëåíñêàÿ'), ('Íîâèíêîâñêàÿ'), 
		('Íîâãîğîäñêàÿ'), ('Íîâàÿ'),	('Íîâàòîğñêàÿ'), ('Íèêèôîğîâà'), ('Íèêèòèíà'), 
		('Í¸ìàíñêàÿ'), ('Íåôòÿíàÿ'), ('Íåñòåğîâà'), 
		
		('Îáîéíàÿ'), ('Îãàğ¸âà'), ('Îãîğîäíèöêàÿ'), ('Îäåññêàÿ'),  ('Îäèíöîâà'), ('Îäîåâñêîãî'), 
		('Îçåğíàÿ'), ('Îêğåñòèíà'), ('Îêòÿáğüñêàÿ'), ('Îëåøåâà'),	('Îëüõîâàÿ'), ('Îëüøåâñêîãî'), 
		('Îøìÿíñêàÿ'), ('Îõîòñêàÿ'), ('Îñíîâàòåëåé'), ('Îñòğîøèöêàÿ'), ('Îñèïîâè÷ñêàÿ'), ('Îñèïåíêî'), 
		('Îñåííÿÿ'), ('Îñâîáîæäåíèÿ'), ('Îñâåéñêàÿ'),	('Îğøàíñêàÿ'), ('Îğäæîíèêèäçå'), ('Îğëîâñêàÿ'), 
		('Îëüøåâñêîãî'), ('Îğàíæåğåéíàÿ'), ('Îìåëüÿíşêà'), 
		
		('Ïàâëîâà'), ('Ïàâëîâñêîãî'), ('Ïàíôèëîâà'), ('Ïàí÷åíêî'),
		('Ïàïàíèíà'), ('Ïàïåğíÿíñêàÿ'), ('Ïàğàøşòèñòîâ'), ('Ïàğàøşòíàÿ'), ('Ïàğêîâàÿ'), 
		('Ïàğíèêîâàÿ'), ('Ïàğòèçàíñêàÿ'), ('Ïàğõîìåíêî'), ('Ïàøêåâè÷à'), 
		('Ïåíçåíñêàÿ'), ('Ïåğâîìàéñêàÿ'),	('Ïåğåäîâàÿ'), ('Ïåğåõîäíàÿ'), ('Ïåğìñêàÿ'), 
		('Ïåñî÷íàÿ 2-ÿ'), ('Ïåòğîâùèíà'), ('Ïèëîòñêàÿ'), ('Ïèíñêàÿ'), ('Ïèîíåğñêàÿ'), 
		('Ïèğîãîâà'), ('Ïëàí¸ğíàÿ'),  ('Ïëàòîíîâà'), ('Ïëåõàíîâà'), ('Ïîäëåñíàÿ'), 
		('Ïîäãîğíàÿ'), ('Ïîäîëüñêàÿ'), ('Ïîïîâà'),	('Ïîíîìàğ¸âà'), ('Ïîæàğíàÿ'), ('Ïîæàğñêîãî'), 
		('Ïîëåâàÿ'), ('Ïîëåññêàÿ'), ('Ïóòèëîâà'), ('Ïóõîâè÷ñêàÿ'), ('Ïóòåéñêàÿ'), ('Ïóëèõîâà'), 
		('Ïóãà÷¸âñêàÿ '), ('Ïğóøèíñêèõ'), ('Ïî÷òîâàÿ'),	('Ïñêîâñêàÿ'), ('Ïğîìûøëåííàÿ'), ('Ïğÿìàÿ'), 
		('Ïğèîç¸ğíàÿ'),		('Ïğîôñîşçíàÿ'), ('Ïğîãğåññèâíàÿ'), ('Ïğèòûöêîãî'), ('Ïğèëóêñêàÿ'),  
		('Ïğèäîğîæíàÿ'), ('Ïğèãîğîäíàÿ'), 	('Ïğèâåòëèâàÿ'), ('Ïğæåâàëüñêîãî 2-ÿ'), ('Ïğæåâàëüñêîãî'),
		('Ïîíîìàğåíêî'),	('Ïîëÿğíàÿ'), ('Ïîñòàâñêàÿ'), ('Ïîñåëêîâàÿ 1-ÿ'), ('Ïîñåëêîâàÿ 2-ÿ'), ('Ïîëòàâñêàÿ'), ('Ïîëèãğàôè÷åñêàÿ'), 
		
		('Ğàáêîğîâñêàÿ'), ('Ğàäèàëüíàÿ'), ('Ğàäèàòîğíàÿ 1-ÿ'), ('Ğàäèàòîğíàÿ 2-ÿ'), ('Ğàäèùåâà'),	
		('Ğàäîøêîâè÷ñêàÿ'), ('Ğàçèíñêàÿ'), ('Ğàôèåâà'), ('Ğàéíèñà'), ('Ğàäóæíàÿ'), ('Ğàêîâñêàÿ'), 
		('Ğàóáè÷ñêàÿ'), ('Ğåâîëşöèîííàÿ'), ('Ğåïèíà'), ('Ğå÷íàÿ'),  ('Ğæàâåöêàÿ'), ('Ğèæñêàÿ'), 
		('Ğîäíèêîâàÿ'), ('Ğîãà÷¸âñêàÿ'), ('Ğîìàíîâñêàÿ Ñëîáîäà'), ('Ğîìàøêèíà'), ('Ğîìåíñêàÿ'), ('Ğîòìèñòğîâà'), 
		('Ğóñàíîâè÷à'), ('Ğóññèÿíîâà'), ('Ğîññîíñêàÿ'), ('Ğóìÿíöåâà'), ('Ğûáàëêî'), ('Ğûëååâà'), 
		('Ğóùèöà'), ('Ğÿáèííèöêàÿ'), ('Ğÿáèíîâàÿ'),	
		
		('Ñàäîâàÿ'), ('Ñàï¸ğîâ'), ('Ñâåòëàÿ'),	('Ñâåğäëîâà'), ('Ñâèñëî÷ñêàÿ'), ('Ñâîáîäû'),
		('Ñâÿçèñòîâ'), ('Ñåâàñòîïîëüñêàÿ'), ('Ñåäîâà'), 
		('Ñåäûõ'), ('Ñåëèöêîãî'), ('Ñåìàøêî'), ('Ñåì¸íîâà'), ('Ñåííèöêàÿ'), ('Ñåğàôèìîâè÷à'),
		('Ñåğäè÷à'), ('Ñåğåáğÿíîå Êîëüöî'), ('Ñåğåáğÿíñêàÿ'), ('Ñåğåáğÿíñêàÿ Ìàëàÿ'), ('Ñåğîâà'), 
		('Ñå÷åíîâà'), ('Ñèğåíåâàÿ'), ('Ñêàëèíñêàÿ'), ('Ñêîğèíû'), 
		('Ñêğèïíèêîâà'), ('Ñêğûãàíîâà'),	('Ñëàâèíñêîãî'), ('Ñëàâÿíñêàÿ'), ('Ñëåïíÿ Áîëüøàÿ'), 
		('Ñëåñàğíàÿ'), ('Ñëîíèìñêàÿ'), ('Ñëóöêîé'), 		
		('Ñëîáîäñêàÿ'), ('Ñìèğíîâà'), ('Ñìîëåíñêàÿ'), ('Ñìîëÿ÷êîâà'),  ('Ñûğîêîìëè'), ('Ñóõàğåâñêàÿ'), 
		('Ñóõàÿ'), ('Ñóğèêîâà'), ('Ñóğãàíîâà'), ('Ñóğàæñêàÿ'),	('Ñóäìàëèñà'), ('Ñóâîğîâà'), 
		('Ñòåïíàÿ'), ('Ìàëîå Ñòèêë¸âî'), ('Ñòóäåí÷åñêàÿ'), ('Ñòğîèòåëåé'), ('Ñòğåëêîâàÿ'), ('Ñòîëåòîâà'), 
		('Ñòîëáöîâñêàÿ'), ('Ñòåôàíîâñêàÿ'), ('Ñòåáåí¸âà'),	('Ñòàõàíîâñêàÿ'), ('Ñòàñîâà'), ('Ñòîğîæåâñêàÿ'), 
		('Ñòàğîâèëåíñêàÿ'), ('Ñòàğîáèíñêàÿ'), ('Ñòàíèñëàâñêîãî'), 
		('Ñòåïÿíñêàÿ'), ('Ñòàäèîííàÿ'), ('Ñòàğèíîâñêàÿ'), ('Ñîöèàëèñòè÷åñêàÿ'), ('Ñîñíîâûé áîğ'),	
		('Ñîëòûñà'), ('Ñîëîìåííàÿ'), ('Ñîëíå÷íàÿ'), ('Ñîñíîâàÿ'), ('Ñîâåòñêàÿ'), ('Ñîáèíîâà'),
		
		('Òà¸æíàÿ'), ('Òàëàøà'), ('Òàëëèíñêàÿ'), ('Òàíêà'),  ('Òàğàøêåâè÷à'), ('Òàğõàíîâà'), 
		('Òàòàğñêàÿ'), ('Òàøêåíòñêàÿ'), ('Òáèëèññêàÿ'), ('Òåíèñòàÿ'), ('Òåïëè÷íàÿ'), ('Òèêîöêîãî'), 
		('Òèìèğÿçåâà'), ('Òèìîøåíêî'), ('Òèğàæíàÿ'), ('Òèõàÿ'), ('Òîëñòîãî'), ('Òÿïèíñêîãî'), 
		('Òóïèêîâàÿ'), ('Òóõà÷åâñêîãî'), ('Òóğãåíåâà'),	
		('Òóïîëåâà'), ('Òóëüñêàÿ'), ('Òğóñà'),	('Òğîñòåíåö Ìàëûé'), ('Òğóäîâàÿ'), ('Òğîñòåíåöêàÿ'),
		('Òîïîãğàôè÷åñêàÿ'), ('Òîìñêàÿ'), 
		
		('Óáîğåâè÷à'), ('Óêğàèíñêàÿ'), ('Óêğàèíêè'), ('Óëüÿíîâñêàÿ'), ('Óìàíñêàÿ'), ('Óìàíñêàÿ 1-ÿ'),
		('Óğàëüñêàÿ'), ('Óğîæàéíàÿ'), ('Óğó÷ñêàÿ'), ('Óğó÷üå'), ('Óñàäåáíàÿ'), 
		('Óôèìñêàÿ'), ('Óøàêîâà'), ('Óøà÷ñêàÿ'), ('Óşòíàÿ'), 

		('Ôàáğèöèóñà'), ('Ôàáğè÷íàÿ'),	('Ôàíèïîëüñêàÿ'), ('Ôåäîòîâà'), ('Ôèçêóëüòóğíàÿ'), 
		('Ôó÷èêà'), ('Ôğóíçå'), ('Ôğîëèêîâà'), 		
		('Ôîìèíà'), ('Ôîëüâàğêîâàÿ'), ('Ôîãåëÿ'), ('Ôèëèìîíîâà'),  ('Ôèëàòîâà'), 
		
		('Õàáàğîâñêàÿ'), 
		('Õàëòóğèíà'), ('Õàğüêîâñêàÿ'), ('Õìàğèíñêàÿ'), ('Õìåëåâñêîãî'),('Õîğóæåé'), ('Õîëìîãîğñêàÿ'), 
		('Õìåëüíèöêîãî'), 
		
		('Öåíòğàëüíàÿ'), ('Öèîëêîâñêîãî'), ('Öíÿíñêàÿ'), 
		
		('×àéêèíîé'), ('×àéêîâñêîãî'), ('×àéëûòêî'), ('×àïàåâà'), ('×àğîòà'),('×åáîòàğ¸âà'), 
		('×åêàëèíà'), ('×åëşñêèíöåâ'), ('×åğâÿêîâà'), ('×åğíèãîâñêàÿ'), ('×şğë¸íèñà'), 
		('×îğíîãî'), ('×êàëîâà'), ('×èæåâñêèõ'), ('×è÷åğèíà'), ('×èæîâñêàÿ'),	
		('×èãëàäçå'), ('×åõîâà'), ('×å÷îòà'), ('×åğíÿõîâñêîãî'), ('×åğíûøåâñêîãî'), 
		
		('Øàáàíû'), ('Øàáëîâñêîãî'), ('Øàğàíãîâè÷à'), ('Øàòüêî'), ('Øàôàğíÿíñêàÿ'), 
		('Øåéïè÷è'),('Øåìåøà'), ('Øèğìû'), ('Øèğîêàÿ'), ('Øèøêèíà'), ('Øïèëåâñêîãî'), ('Øêîëüíàÿ'), 
		('Øîğíàÿ'), ('Øîññåéíàÿ'), ('Øóãàåâà'), ('Øóìèëèíñêàÿ'), 
		
		('Ùåäğèíà'), ('Ùåïêèíà'), ('Ùåğáàêîâà'), ('Ùîğñà'), ('Ù¸òîâêà'),

		('İêñêàâàòîğíàÿ'), ('İíãåëüñà'), ('Şáèëåéíàÿ'), ('Şæíàÿ'), ('Şíîøåñêàÿ'), 
		('ßğêîâñêàÿ'),('ßñíàÿ'), ('ßáëîíåâàÿ'), ('ßêóáîâà'), ('ßêóáîâñêîãî'), ('ßíêîâñêîãî'),
		('ßíòàğíàÿ'), ('ßğîøåâè÷ñêàÿ');

create view AllUsers AS
Select * from  USERs;

create view AllDrivers AS
Select * from DRIVERs;

create view AllTrips AS
Select * from TRIPs;

select * from AllUsers;
select * from AllDrivers;
select * from AllTrips;

